In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('test.csv')
df

      name  Age  Graduateed?
0    Su Su   20        False
1    Mg Mg   29         True
2     KoKo   12         True
3    Ma Ma   18        False
4  Aye Aye   20         True

In [3]:
df = pd.read_csv('test.csv', index_col=0) # first column becomes index
df

         Age  Graduateed?
name
Su Su     20        False
Mg Mg     29         True
KoKo      12         True
Ma Ma     18        False
Aye Aye   20         True

In [4]:
df = pd.read_json('test.json')
df

        Name   Department  Salary
0    Win Win  Engineering  250000
1  Sein Sein           IT  300000
2  Aung Aung      Finance  200000
3      Ni Ni           HR  150000
4   Maung Ba      Finance  205000
5  Maung Hla           HR  155000

In [61]:
import sqlite3 as sql

In [62]:
conn = sql.connect('test.db')
conn

In [63]:
db_df = pd.read_sql_query('SELECT * FROM employee', conn)
db_df

   id       name  department  salary
0   1      Ko Ko          IT  200000
1   2      Ma Ma  Management  150000
2   3      Su Su          IT  200000
3   4    Aye Aye          HR  150000
4   5  Aung Aung  Management  150000

In [64]:
db_df.set_index('id', inplace=True) # set index

In [65]:
db_df.reset_index() # reste index

   id       name  department  salary
0   1      Ko Ko          IT  200000
1   2      Ma Ma  Management  150000
2   3      Su Su          IT  200000
3   4    Aye Aye          HR  150000
4   5  Aung Aung  Management  150000

In [69]:
# append to db_df, not pd's method, appending accept only ignore_index=True
db_df = db_df.append({'id' : 'NaN', 'name' : 'Ko Ko', 'department' : 'IT', 'salary' : 200000}, ignore_index=True)

In [70]:
db_df

        name  department  salary   id
0      Ko Ko          IT  200000  NaN
1      Ma Ma  Management  150000  NaN
2      Su Su          IT  200000  NaN
3    Aye Aye          HR  150000  NaN
4  Aung Aung  Management  150000  NaN
5      Ko Ko          IT  200000  NaN

In [71]:
db_df.to_sql('new_employee', conn)

In [72]:
db_df.to_csv('db_2_csv.csv')